console.log('----------------Завдання 1_ДОП-----------------')
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// --------------------------------------------------------------------------------------------------
// let m = ['a', 'b', 'c'];
// let word = '';
// for (i = 0; i < m.length; i++){
//     word = (`${word}${m[i]}`);
// }
// console.log(word);
// -----------------------------------------------------------------------------------------------------
console.log('----------------Завдання 2_ДОП-----------------')
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// ---------------------------------------------------------------------------------------------------
// let m = ['a', 'b', 'c'];
// let word = '';
// let i = 0;
// while(i < m.length){
//     word = (`${word}${m[i]}`);
//     i++;
// }
// console.log(word);
// -----------------------------------------------------------------------------------------------------
console.log('----------------Завдання 3_ДОП-----------------')
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// -----------------------------------------------------------------------------------------------------
// let m = ['a', 'b', 'c'];
// let word = '';
// for(let value of m){
//     word = (`${word}${value}`);
// }
// console.log(word);
// -----------------------------------------------------------------------------------------------------
console.log('----------------Завдання 4_ДОП-----------------')
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for in зібрати всі букви в слово.
// -------------------------------------------------------------------------------------------------------
let m = ['a', 'b', 'c'];
let word = '';
for(let key in m){
    word = word + m[key];
}
console.log(word);
